## Introduction to Databases

### Using SQLAlchemy 

Based in [this](https://medium.com/hacking-datascience/sqlalchemy-python-tutorial-abcc2ec77b57), [this](https://medium.com/dataexplorations/sqlalchemy-orm-a-more-pythonic-way-of-interacting-with-your-database-935b57fd2d4d) and [this](https://auth0.com/blog/sqlalchemy-orm-tutorial-for-python-developers/)

SQLAlchemy provides a nice “Pythonic” way of interacting with databases. So rather than dealing with the differences between specific dialects of traditional SQL such as MySQL or PostgreSQL or Oracle, you can leverage the Pythonic framework of SQLAlchemy to streamline your workflow and more efficiently query your data.

In [1]:
#!pip install mysqlclient
#!pip install python-dotenv
#!pip install sqlalchemy

In [2]:
import os
import getpass
import pandas as pd

import sqlalchemy

### Connecting to a database

To start interacting with the database we first we need to establish a connection.  

Some examples of connecting to various databases can be found [here](http://docs.sqlalchemy.org/en/latest/core/engines.html#postgresql)

### Viewing Table Details

SQLAlchemy can be used to automatically load tables from a database using something called reflection. Reflection is the process of reading the database and building the metadata based on that information.

In [3]:
engine = sqlalchemy.create_engine('sqlite:///../SampleDBs/chinook.sqlite')
connection = engine.connect()
metadata = sqlalchemy.MetaData()

albums = sqlalchemy.Table('albums', metadata, autoload=True, autoload_with=engine)

In [4]:
type(albums)

sqlalchemy.sql.schema.Table

In [5]:
# Print the column names
print(albums.columns.keys())

['AlbumId', 'Title', 'ArtistId']

In [6]:
# Print full table metadata
print(repr(metadata.tables['albums']))

Table('albums', MetaData(), Column('AlbumId', INTEGER(), table=<albums>, primary_key=True, nullable=False), Column('Title', NVARCHAR(length=160), table=<albums>, nullable=False), Column('ArtistId', INTEGER(), ForeignKey('artists.ArtistId'), table=<albums>, nullable=False), schema=None)

### Querying

ResultProxy: The object returned by the .execute() method. It can be used in a variety of ways to get the data returned by the query.  

ResultSet: The actual data asked for in the query when using a fetch method such as .fetchall() on a ResultProxy.

In [7]:
#Equivalent to 'SELECT * FROM albums'
query = sqlalchemy.select([albums])

In [8]:
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
#partial_results = ResultProxy.fetchmany(50)
ResultSet[:3]

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2)]

Convert to dataframe

In [9]:
df = pd.DataFrame(ResultSet)
df.columns = ResultSet[0].keys()
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

### Filtering data

Let's see some examples of raw SQLite Queries and queries using SQLAlchemy.

#### where

In [10]:
## SQL :SELECT * FROM artists WHERE Name = "Caetano Veloso" :

artists = sqlalchemy.Table('artists', metadata, autoload=True, autoload_with=engine)

query = sqlalchemy.select([artists]).where(artists.columns.Name == 'Caetano Veloso')
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

[(16, 'Caetano Veloso')]

#### in

In [11]:
## SQL : SELECT FirstName, LastName FROM customers WHERE state IN ("Rio de Janeiro", "New York")

customers = sqlalchemy.Table('customers', metadata, autoload=True, autoload_with=engine)

query = sqlalchemy.select([customers.columns.FirstName, 
                           customers.columns.LastName]).where(customers.columns.City.in_(['Rio de Janeiro', 'New York']))

ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

[('Roberto', 'Almeida'), ('Michelle', 'Brooks')]

#### and, or, not

In [12]:
## SQL :SELECT * FROM customers WHERE City = 'Rio de Janeiro' AND NOT FirstName = 'Roberta'
    
customers = sqlalchemy.Table('customers', metadata, autoload=True, autoload_with=engine)

query = sqlalchemy.select([customers]).where(sqlalchemy.and_(customers.columns.City == "Rio de Janeiro",
                                                             customers.columns.FirstName != "Roberta")
                                            )
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

[(12, 'Roberto', 'Almeida', 'Riotur', 'Praça Pio X, 119', 'Rio de Janeiro', 'RJ', 'Brazil', '20040-020', '+55 (21) 2271-7000', '+55 (21) 2271-7070', 'roberto.almeida@riotur.gov.br', 3)]

#### order by

In [13]:
## SQL : SELECT * FROM customers ORDER BY City DESC, Country

customers = sqlalchemy.Table('customers', metadata, autoload=True, autoload_with=engine)

query = sqlalchemy.select([customers]).order_by(sqlalchemy.desc(customers.columns.City), customers.columns.Country)
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet[:3]

[(33, 'Ellie', 'Sullivan', None, '5112 48 Street', 'Yellowknife', 'NT', 'Canada', 'X1A 1N6', '+1 (867) 920-2233', None, 'ellie.sullivan@shaw.ca', 3),
 (32, 'Aaron', 'Mitchell', None, '696 Osborne Street', 'Winnipeg', 'MB', 'Canada', 'R3L 2B9', '+1 (204) 452-6452', None, 'aaronmitchell@yahoo.ca', 4),
 (49, 'Stanisław', 'Wójcik', None, 'Ordynacka 10', 'Warsaw', None, 'Poland', '00-358', '+48 22 828 37 39', None, 'stanisław.wójcik@wp.pl', 4)]

#### functions
other functions include avg, count, min, max…

In [14]:
##SQL : SELECT SUM(Total) FROM invoices 
    
invoices = sqlalchemy.Table('invoices', metadata, autoload=True, autoload_with=engine)

query = sqlalchemy.select([sqlalchemy.func.sum(invoices.columns.Total)])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet

/tmp/ipykernel_485430/2776607211.py:6: SAWarning: Dialect sqlite+pysqlite does *not* support Decimal objects natively, and SQLAlchemy must convert from floating point - rounding errors and other issues may occur. Please consider storing Decimal numbers as strings or integers on this platform for lossless storage.
  ResultProxy = connection.execute(query)

[(Decimal('2328.60'),)]

#### group by

In [15]:
##SQL : SELECT SUM(Total) as Total, InvoiceDate FROM invoices GROUP BY InvoiceDate

invoices = sqlalchemy.Table('invoices', metadata, autoload=True, autoload_with=engine)

query = sqlalchemy.select([sqlalchemy.func.sum(invoices.columns.Total).label('Total'), 
                           invoices.columns.InvoiceDate]).group_by(invoices.columns.InvoiceDate)

ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet[:5]

[(Decimal('1.98'), datetime.datetime(2009, 1, 1, 0, 0)),
 (Decimal('3.96'), datetime.datetime(2009, 1, 2, 0, 0)),
 (Decimal('5.94'), datetime.datetime(2009, 1, 3, 0, 0)),
 (Decimal('8.91'), datetime.datetime(2009, 1, 6, 0, 0)),
 (Decimal('13.86'), datetime.datetime(2009, 1, 11, 0, 0))]

#### distinct

In [16]:
## SQL : SELECT DISTINCT state FROM censusSQLAlchemy :

invoices = sqlalchemy.Table('invoices', metadata, autoload=True, autoload_with=engine)

query = sqlalchemy.select([invoices.columns.CustomerId.distinct()])

ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet[:5]

[(1,), (2,), (3,), (4,), (5,)]

#### joins

In [17]:
artists = sqlalchemy.Table('artists', metadata, autoload=True, autoload_with=engine)
albums = sqlalchemy.Table('albums', metadata, autoload=True, autoload_with=engine)

### Automatic Join

In [18]:
query = sqlalchemy.select([artists, albums])
#query = sqlalchemy.select([artists.columns.Name, albums.columns.Title])

results = connection.execute(query).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(5)

/tmp/ipykernel_485430/2923725910.py:4: SAWarning: SELECT statement has a cartesian product between FROM element(s) "artists" and FROM element "albums".  Apply join condition(s) between each element to resolve.
  results = connection.execute(query).fetchall()

   ArtistId   Name  AlbumId                                  Title  ArtistId_1
0         1  AC/DC        1  For Those About To Rock We Salute You           1
1         1  AC/DC        2                      Balls to the Wall           2
2         1  AC/DC        3                      Restless and Wild           2
3         1  AC/DC        4                      Let There Be Rock           1
4         1  AC/DC        5                               Big Ones           3

### Manual Join

In [19]:
query = sqlalchemy.select([artists, albums])
query = query.select_from(artists.join(albums, artists.columns.ArtistId == albums.columns.ArtistId))

results = connection.execute(query).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(5)

,ArtistId,Name,AlbumId,Title,ArtistId_1
0,1,AC/DC,1,For Those About To Rock We Salute You,1
1,2,Accept,2,Balls to the Wall,2
2,2,Accept,3,Restless and Wild,2
3,1,AC/DC,4,Let There Be Rock,1
4,3,Aerosmith,5,Big Ones,3

## Creating and Inserting Data into Tables

By passing the database which is not present, to the engine then sqlalchemy automatically creates a new database.

In [20]:
#Create test.sqlite if not exists

engine = sqlalchemy.create_engine('sqlite:///../SampleDBs/test.sqlite')

connection = engine.connect()
metadata = sqlalchemy.MetaData()

In [21]:
emp = sqlalchemy.Table('emp', metadata,
                       sqlalchemy.Column('Id', sqlalchemy.Integer()),
                       sqlalchemy.Column('name', sqlalchemy.String(255), nullable=False),
                       sqlalchemy.Column('salary', sqlalchemy.Float(), default=100.0),
                       sqlalchemy.Column('active', sqlalchemy.Boolean(), default=True)
                      )

metadata.create_all(engine) #Creates the table

In [22]:
#Inserting record one by one

query = sqlalchemy.insert(emp).values(Id=1, name='naveen', salary=60000.00, active=True) 
ResultProxy = connection.execute(query)

In [23]:
#Inserting many records at ones

query = sqlalchemy.insert(emp) 
values_list = [{'Id':'2', 'name':'ram', 'salary':80000, 'active':False},
               {'Id':'3', 'name':'ramesh', 'salary':70000, 'active':True}]

ResultProxy = connection.execute(query,values_list)

In [24]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head()

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

### Updating data in Databases

db.update(table_name).values(attribute = new_value).where(condition)

In [25]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()

df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head()

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

In [26]:
# Build a statement to update the salary of Id = 1 to to 100000

query = sqlalchemy.update(emp).values(salary = 100000)
query = query.where(emp.columns.Id == 1)
results = connection.execute(query)

In [27]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head()

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

#### Delete tuples from Table

db.delete(table_name).where(condition)

In [28]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head()

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

In [29]:
# Build a statement to delete where salary < 80000

query = sqlalchemy.delete(emp)
query = query.where(emp.columns.salary < 80000)
results = connection.execute(query)

In [30]:
results = connection.execute(sqlalchemy.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head()

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False

#### Dropping a Table

table_name.drop(engine) #drops a single table  
metadata.drop_all(engine) #drops all the tables in the database

### Removing the database

In [31]:
os.remove('../SampleDBs/test.sqlite')

### Creating ERM Model using SQLAlchemy ORM

### Option 1 — Raw SQL

In [32]:
from sqlalchemy import create_engine
#db = create_engine('dialect+driver://user:pass@host:port/db')
#db = create_engine(f'postgresql://{DB_USER}:{DB_PASS}@{IP}:{DB_PORT}/{DB_NAME}')

db = create_engine('sqlite:///../SampleDBs/college.sqlite')

In [34]:
db.execute("""
CREATE TABLE IF NOT EXISTS students (
    id integer PRIMARY KEY,
    name VARCHAR,
    lastname VARCHAR)
    """)

db.execute("""
CREATE TABLE IF NOT EXISTS addresses (
    id integer PRIMARY KEY,
    st_id INTEGER,
    postal_add VARCHAR,
    email_add VARCHAR,
    FOREIGN KEY(st_id) REFERENCES students (id))
    """)

#### Deleting Database

In [35]:
try:
    os.remove("../SampleDBs/college.sqlite")
    print("removed file")
except:
    print("file does not exist")

removed file

### Option 2 — SQLAlchemy Core

In [36]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, Sequence, Float, PrimaryKeyConstraint, ForeignKey
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker, relationship, backref
from sqlalchemy.sql import select

In [37]:
db = create_engine('sqlite:///../SampleDBs/college.sqlite', echo=True)
meta = MetaData()

In [38]:
students = Table('students', meta,
                 Column('id', Integer, primary_key = True), 
                 Column('name', String), 
                 Column('lastname', String), 
                )

addresses = Table('addresses', meta, 
                  Column('id', Integer, primary_key = True), 
                  Column('st_id', Integer, ForeignKey('students.id')), 
                  Column('postal_add', String), 
                  Column('email_add', String))

meta.create_all(db)

2021-10-26 18:33:32,285 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:32,289 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("students")
2021-10-26 18:33:32,291 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:32,295 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("students")
2021-10-26 18:33:32,296 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:32,298 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("addresses")
2021-10-26 18:33:32,299 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:32,301 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("addresses")
2021-10-26 18:33:32,302 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:32,303 INFO sqlalchemy.engine.Engine
CREATE TABLE students (
	id INTEGER NOT NULL,
	name VARCHAR,
	lastname VARCHAR,
	PRIMARY KEY (id)
)


2021-10-26 18:33:32,304 INFO sqlalchemy.engine.Engine [no key 0.00080s] ()
2021-10-26 18:33:32,602 INFO sqlalchemy.engine.Engine
CREATE TABLE addresses (
	id INTEGER NOT NULL,
	st_id INTEGER,
	postal_add VARCHAR,
	email_add VARCHAR,
	PRIMARY KEY (id),
	FOREIGN KEY(st_id) REFERENCES students (id)
)


2021-10-26 18:33:32,604 INFO sqlalchemy.engine.Engine [no key 0.00144s] ()
2021-10-26 18:33:32,886 INFO sqlalchemy.engine.Engine COMMIT

#### Adding some data

In [39]:
conn = db.connect()

conn.execute(students.insert(), [
   {'name':'Renato', 'lastname':'Nieztsche'},
   {'name':'Leonardo', 'lastname' : 'Steinberg'},
   {'name':'Pedro','lastname' : 'Rocha'},
   {'name':'Roberto','lastname' : 'Souza'},
   {'name':'Ana Maria','lastname' : 'Medeiros'},
])

2021-10-26 18:33:32,906 INFO sqlalchemy.engine.Engine INSERT INTO students (name, lastname) VALUES (?, ?)
2021-10-26 18:33:32,908 INFO sqlalchemy.engine.Engine [generated in 0.00278s] (('Renato', 'Nieztsche'), ('Leonardo', 'Steinberg'), ('Pedro', 'Rocha'), ('Roberto', 'Souza'), ('Ana Maria', 'Medeiros'))
2021-10-26 18:33:32,912 INFO sqlalchemy.engine.Engine COMMIT

In [40]:
conn.execute(addresses.insert(), [
   {'st_id':1, 'postal_add':'Ap #505-6795 Tincidunt Street', 'email_add':'rnieztsche@gmail.com'},
   {'st_id':1, 'postal_add':'Ap #619-5142 Imperdiet St', 'email_add':'lstein@gmail.com'},
   {'st_id':3, 'postal_add':'P.O. Box 733, 9483 Amet St.', 'email_add':'procha@gmail.com'},
   {'st_id':5, 'postal_add':'307-2719 Mi, St.', 'email_add':'rrobs@yahoo.com'},
   {'st_id':2, 'postal_add':'589-8925 Odio Ave', 'email_add':'amares@protonmail.com'},
])

2021-10-26 18:33:33,650 INFO sqlalchemy.engine.Engine INSERT INTO addresses (st_id, postal_add, email_add) VALUES (?, ?, ?)
2021-10-26 18:33:33,652 INFO sqlalchemy.engine.Engine [generated in 0.00176s] ((1, 'Ap #505-6795 Tincidunt Street', 'rnieztsche@gmail.com'), (1, 'Ap #619-5142 Imperdiet St', 'lstein@gmail.com'), (3, 'P.O. Box 733, 9483 Amet St.', 'procha@gmail.com'), (5, '307-2719 Mi, St.', 'rrobs@yahoo.com'), (2, '589-8925 Odio Ave', 'amares@protonmail.com'))
2021-10-26 18:33:33,654 INFO sqlalchemy.engine.Engine COMMIT

In [41]:
s = select([students, addresses]).where(students.c.id == addresses.c.st_id)
result = conn.execute(s)

for row in result:
    print(row)

2021-10-26 18:33:33,976 INFO sqlalchemy.engine.Engine SELECT students.id, students.name, students.lastname, addresses.id AS id_1, addresses.st_id, addresses.postal_add, addresses.email_add
FROM students, addresses
WHERE students.id = addresses.st_id
2021-10-26 18:33:33,979 INFO sqlalchemy.engine.Engine [generated in 0.00323s] ()
(1, 'Renato', 'Nieztsche', 1, 1, 'Ap #505-6795 Tincidunt Street', 'rnieztsche@gmail.com')
(1, 'Renato', 'Nieztsche', 2, 1, 'Ap #619-5142 Imperdiet St', 'lstein@gmail.com')
(3, 'Pedro', 'Rocha', 3, 3, 'P.O. Box 733, 9483 Amet St.', 'procha@gmail.com')
(5, 'Ana Maria', 'Medeiros', 4, 5, '307-2719 Mi, St.', 'rrobs@yahoo.com')
(2, 'Leonardo', 'Steinberg', 5, 2, '589-8925 Odio Ave', 'amares@protonmail.com')

In [42]:
try:
    os.remove("../SampleDBs/college.sqlite")
    print("removed file")
except:
    print("file does not exist")

removed file

### Option 3 — [SQLAlchemy ORM](https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_orm_declaring_mapping.htm)

In [43]:
from sqlalchemy import create_engine
db = create_engine('sqlite:///../SampleDBs/sales.db', echo=True)

In [44]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

In [45]:
class Customers(Base):
    __tablename__ = 'customers'
    id = Column(Integer, primary_key=True)
    name = Column(String)
    address = Column(String)
    email = Column(String)

Base.metadata.create_all(db)

2021-10-26 18:33:35,555 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:35,557 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("customers")
2021-10-26 18:33:35,558 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:35,562 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("customers")
2021-10-26 18:33:35,563 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:35,566 INFO sqlalchemy.engine.Engine
CREATE TABLE customers (
	id INTEGER NOT NULL,
	name VARCHAR,
	address VARCHAR,
	email VARCHAR,
	PRIMARY KEY (id)
)


2021-10-26 18:33:35,568 INFO sqlalchemy.engine.Engine [no key 0.00182s] ()
2021-10-26 18:33:36,001 INFO sqlalchemy.engine.Engine COMMIT

In [46]:
from sqlalchemy.orm import sessionmaker
Session = sessionmaker(bind = db)
session = Session()

#### Adding records

In [47]:
c1 = Customers(name = 'Renato Souza', address = 'Sagedergasse 21A', email = 'meu_email@gmail.com')

session.add(c1)
session.commit()

2021-10-26 18:33:36,555 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:36,559 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:36,561 INFO sqlalchemy.engine.Engine [generated in 0.00195s] ('Renato Souza', 'Sagedergasse 21A', 'meu_email@gmail.com')
2021-10-26 18:33:36,565 INFO sqlalchemy.engine.Engine COMMIT

In [48]:
session.add_all([
   Customers(name = 'Hans Andersen', address = 'Yellow Brick Road, 43', email = 'hca_thebest@gmail.com'), 
   Customers(name = 'Monteiro Lobato', address = 'Raiffeisengürtel, 1234', email = 'narizinho@gmail.com'), 
   Customers(name = 'Rolando Lero', address = 'Rua do Lavradio, 34', email = 'chico@gmail.com')]
)

session.commit()

2021-10-26 18:33:36,846 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:36,849 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:36,851 INFO sqlalchemy.engine.Engine [cached since 0.2921s ago] ('Hans Andersen', 'Yellow Brick Road, 43', 'hca_thebest@gmail.com')
2021-10-26 18:33:36,854 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:36,856 INFO sqlalchemy.engine.Engine [cached since 0.2976s ago] ('Monteiro Lobato', 'Raiffeisengürtel, 1234', 'narizinho@gmail.com')
2021-10-26 18:33:36,858 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:36,860 INFO sqlalchemy.engine.Engine [cached since 0.3016s ago] ('Rolando Lero', 'Rua do Lavradio, 34', 'chico@gmail.com')
2021-10-26 18:33:36,863 INFO sqlalchemy.engine.Engine COMMIT

#### Querying

In [49]:
result = session.query(Customers).all()

for row in result:
    print ("Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:37,166 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:37,168 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
2021-10-26 18:33:37,169 INFO sqlalchemy.engine.Engine [generated in 0.00080s] ()
Name:  Renato Souza Address: Sagedergasse 21A Email: meu_email@gmail.com
Name:  Hans Andersen Address: Yellow Brick Road, 43 Email: hca_thebest@gmail.com
Name:  Monteiro Lobato Address: Raiffeisengürtel, 1234 Email: narizinho@gmail.com
Name:  Rolando Lero Address: Rua do Lavradio, 34 Email: chico@gmail.com

#### [Updating](https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_orm_updating_objects.htm)

In [50]:
x = session.query(Customers).get(1)
print ("Name: ", x.name, "Address:", x.address, "Email:", x.email)

Name:  Renato Souza Address: Sagedergasse 21A Email: meu_email@gmail.com

In [51]:
x.address = 'New Address modified'
#session.commit()

In [52]:
x = session.query(Customers).first()
print ("Name: ", x.name, "Address:", x.address, "Email:", x.email)

2021-10-26 18:33:37,685 INFO sqlalchemy.engine.Engine UPDATE customers SET address=? WHERE customers.id = ?
2021-10-26 18:33:37,686 INFO sqlalchemy.engine.Engine [generated in 0.00088s] ('New Address modified', 1)
2021-10-26 18:33:37,688 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
 LIMIT ? OFFSET ?
2021-10-26 18:33:37,688 INFO sqlalchemy.engine.Engine [generated in 0.00053s] (1, 0)
Name:  Renato Souza Address: New Address modified Email: meu_email@gmail.com

In [53]:
session.rollback()

print ("Name: ", x.name, "Address:", x.address, "Email:", x.email)

2021-10-26 18:33:37,836 INFO sqlalchemy.engine.Engine ROLLBACK
2021-10-26 18:33:37,841 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:37,847 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id = ?
2021-10-26 18:33:37,849 INFO sqlalchemy.engine.Engine [generated in 0.00216s] (1,)
Name:  Renato Souza Address: Sagedergasse 21A Email: meu_email@gmail.com

#### Filtering

In [54]:
result = session.query(Customers).filter(Customers.id>2)

for row in result:
    print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:38,620 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id > ?
2021-10-26 18:33:38,622 INFO sqlalchemy.engine.Engine [generated in 0.00239s] (2,)
ID: 3 Name:  Monteiro Lobato Address: Raiffeisengürtel, 1234 Email: narizinho@gmail.com
ID: 4 Name:  Rolando Lero Address: Rua do Lavradio, 34 Email: chico@gmail.com

In [55]:
result = session.query(Customers).filter(Customers.id == 2)

for row in result:
   print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:39,067 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id = ?
2021-10-26 18:33:39,068 INFO sqlalchemy.engine.Engine [generated in 0.00094s] (2,)
ID: 2 Name:  Hans Andersen Address: Yellow Brick Road, 43 Email: hca_thebest@gmail.com

In [56]:
result = session.query(Customers).filter(Customers.id != 2)

for row in result:
   print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:39,201 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id != ?
2021-10-26 18:33:39,203 INFO sqlalchemy.engine.Engine [generated in 0.00230s] (2,)
ID: 1 Name:  Renato Souza Address: Sagedergasse 21A Email: meu_email@gmail.com
ID: 3 Name:  Monteiro Lobato Address: Raiffeisengürtel, 1234 Email: narizinho@gmail.com
ID: 4 Name:  Rolando Lero Address: Rua do Lavradio, 34 Email: chico@gmail.com

In [57]:
result = session.query(Customers).filter(Customers.name.like('Ra%'))

for row in result:
    print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:39,480 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.name LIKE ?
2021-10-26 18:33:39,481 INFO sqlalchemy.engine.Engine [generated in 0.00081s] ('Ra%',)

In [58]:
result = session.query(Customers).filter(Customers.id.in_([1,3]))

for row in result:
    print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:40,315 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id IN (?, ?)
2021-10-26 18:33:40,317 INFO sqlalchemy.engine.Engine [generated in 0.00217s] (1, 3)
ID: 1 Name:  Renato Souza Address: Sagedergasse 21A Email: meu_email@gmail.com
ID: 3 Name:  Monteiro Lobato Address: Raiffeisengürtel, 1234 Email: narizinho@gmail.com

In [59]:
result = session.query(Customers).filter(Customers.id>2, Customers.name.like('Ra%'))

for row in result:
    print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:40,744 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id > ? AND customers.name LIKE ?
2021-10-26 18:33:40,746 INFO sqlalchemy.engine.Engine [generated in 0.00190s] (2, 'Ra%')

In [60]:
from sqlalchemy import and_
result = session.query(Customers).filter(and_(Customers.id>2, Customers.name.like('Ra%')))

for row in result:
    print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",rorow.email)

2021-10-26 18:33:40,993 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id > ? AND customers.name LIKE ?
2021-10-26 18:33:40,995 INFO sqlalchemy.engine.Engine [generated in 0.00258s] (2, 'Ra%')

In [61]:
from sqlalchemy import or_
result = session.query(Customers).filter(or_(Customers.id>2, Customers.name.like('Ra%')))

for row in result:
    print ("ID:", row.id, "Name: ",row.name, "Address:",row.address, "Email:",row.email)

2021-10-26 18:33:42,704 INFO sqlalchemy.engine.Engine SELECT customers.id AS customers_id, customers.name AS customers_name, customers.address AS customers_address, customers.email AS customers_email
FROM customers
WHERE customers.id > ? OR customers.name LIKE ?
2021-10-26 18:33:42,706 INFO sqlalchemy.engine.Engine [generated in 0.00203s] (2, 'Ra%')
ID: 3 Name:  Monteiro Lobato Address: Raiffeisengürtel, 1234 Email: narizinho@gmail.com
ID: 4 Name:  Rolando Lero Address: Rua do Lavradio, 34 Email: chico@gmail.com

In [62]:
try:
    os.remove("../SampleDBs/sales.db")
    print("removed file")
except:
    print("file does not exist")

removed file

#### [Building Relationships](https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_orm_building_relationship.htm)

In [63]:
from sqlalchemy import create_engine, ForeignKey, Column, Integer, String
from sqlalchemy.orm import relationship
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

db = create_engine('sqlite:///../SampleDBs/sales.db', echo=True)
Base = declarative_base()

class Customer(Base):
    __tablename__ = 'customers'
    id = Column(Integer, primary_key = True)
    name = Column(String)
    address = Column(String)
    email = Column(String)

class Invoice(Base):
    __tablename__ = 'invoices'
    id = Column(Integer, primary_key = True)
    custid = Column(Integer, ForeignKey('customers.id'))
    invno = Column(Integer)
    amount = Column(Integer)
    customer = relationship("Customer", back_populates = "invoices")

Customer.invoices = relationship("Invoice", order_by = Invoice.id, back_populates = "customer")
Base.metadata.create_all(db)

2021-10-26 18:33:43,836 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:43,839 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("customers")
2021-10-26 18:33:43,842 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:43,844 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("customers")
2021-10-26 18:33:43,846 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:43,848 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("invoices")
2021-10-26 18:33:43,849 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:43,854 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("invoices")
2021-10-26 18:33:43,854 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-26 18:33:43,856 INFO sqlalchemy.engine.Engine
CREATE TABLE customers (
	id INTEGER NOT NULL,
	name VARCHAR,
	address VARCHAR,
	email VARCHAR,
	PRIMARY KEY (id)
)


2021-10-26 18:33:43,857 INFO sqlalchemy.engine.Engine [no key 0.00082s] ()
2021-10-26 18:33:44,506 INFO sqlalchemy.engine.Engine
CREATE TABLE invoices (
	id INTEGER NOT NULL,
	custid INTEGER,
	invno INTEGER,
	amount INTEGER,
	PRIMARY KEY (id),
	FOREIGN KEY(custid) REFERENCES customers (id)
)


2021-10-26 18:33:44,507 INFO sqlalchemy.engine.Engine [no key 0.00103s] ()
2021-10-26 18:33:44,998 INFO sqlalchemy.engine.Engine COMMIT

In [64]:
c1 = Customer(name = "Arnold Hinton", address = "Bank Street", email = "arnold@gmail.com")
c1.invoices = [Invoice(invno = 10, amount = 15000), Invoice(invno = 14, amount = 3850)]

In [65]:
Session = sessionmaker(bind = db)
session = Session()
session.add(c1)
session.commit()

2021-10-26 18:33:45,157 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:45,161 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:45,162 INFO sqlalchemy.engine.Engine [generated in 0.00169s] ('Arnold Hinton', 'Bank Street', 'arnold@gmail.com')
2021-10-26 18:33:45,169 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:45,170 INFO sqlalchemy.engine.Engine [generated in 0.00187s] (1, 10, 15000)
2021-10-26 18:33:45,174 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:45,176 INFO sqlalchemy.engine.Engine [cached since 0.007137s ago] (1, 14, 3850)
2021-10-26 18:33:45,179 INFO sqlalchemy.engine.Engine COMMIT

In [66]:
c2 = [
   Customer(
      name = "Mick Jagger", 
      address = "Abbey Road, 5",
      email = "mick@jagger.com",
      invoices = [Invoice(invno = 3, amount = 10000), 
      Invoice(invno = 4, amount = 5000)]
   )
]

session.add(c2[0])
session.commit()

2021-10-26 18:33:46,161 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:46,165 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:46,166 INFO sqlalchemy.engine.Engine [cached since 1.005s ago] ('Mick Jagger', 'Abbey Road, 5', 'mick@jagger.com')
2021-10-26 18:33:46,168 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:46,169 INFO sqlalchemy.engine.Engine [cached since 1.001s ago] (2, 3, 10000)
2021-10-26 18:33:46,171 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:46,172 INFO sqlalchemy.engine.Engine [cached since 1.003s ago] (2, 4, 5000)
2021-10-26 18:33:46,174 INFO sqlalchemy.engine.Engine COMMIT

In [67]:
rows = [
   Customer(
      name = "Govind Kala", 
      address = "Gulmandi Aurangabad", 
      email = "kala@gmail.com", 
      invoices = [Invoice(invno = 7, amount = 12000), Invoice(invno = 8, amount = 18500)]),

   Customer(
      name = "Abdul Rahman", 
      address = "Rohtak", 
      email = "abdulr@gmail.com",
      invoices = [Invoice(invno = 9, amount = 15000), 
      Invoice(invno = 11, amount = 6000)
   ])
]

session.add_all(rows)
session.commit()

2021-10-26 18:33:46,501 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-26 18:33:46,504 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:46,505 INFO sqlalchemy.engine.Engine [cached since 1.345s ago] ('Govind Kala', 'Gulmandi Aurangabad', 'kala@gmail.com')
2021-10-26 18:33:46,511 INFO sqlalchemy.engine.Engine INSERT INTO customers (name, address, email) VALUES (?, ?, ?)
2021-10-26 18:33:46,513 INFO sqlalchemy.engine.Engine [cached since 1.352s ago] ('Abdul Rahman', 'Rohtak', 'abdulr@gmail.com')
2021-10-26 18:33:46,515 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:46,517 INFO sqlalchemy.engine.Engine [cached since 1.348s ago] (3, 7, 12000)
2021-10-26 18:33:46,519 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:46,520 INFO sqlalchemy.engine.Engine [cached since 1.351s ago] (3, 8, 18500)
2021-10-26 18:33:46,521 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:46,522 INFO sqlalchemy.engine.Engine [cached since 1.353s ago] (4, 9, 15000)
2021-10-26 18:33:46,523 INFO sqlalchemy.engine.Engine INSERT INTO invoices (custid, invno, amount) VALUES (?, ?, ?)
2021-10-26 18:33:46,524 INFO sqlalchemy.engine.Engine [cached since 1.355s ago] (4, 11, 6000)
2021-10-26 18:33:46,525 INFO sqlalchemy.engine.Engine COMMIT

#### [Joins](https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_orm_working_with_joins.htm)

In [ ]:
result = session.query(Customer).join(Invoice).filter(Invoice.amount == 8500)
for row in result:
    for inv in row.invoices:
        print (row.id, row.name, inv.invno, inv.amount)

In [68]:
try:
    os.remove("../SampleDBs/sales.db")
    print("removed file")
except:
    print("file does not exist")

removed file

### Visualizing ER Diagrams with [ERAlchemy](https://github.com/Alexis-benoist/eralchemy)

In [69]:
#!sudo apt-get install python3-dev build-essential
#!sudo apt-get install -y graphviz 
#!pip install eralchemy

In [70]:
#from eralchemy import render_er
## Draw from SQLAlchemy base
#render_er(Base, 'erd_from_sqlalchemy.png')

## Draw from database
#render_er("sqlite:///relative/path/to/db.db", 'erd_from_sqlite.png')